Revit 2025 API
FabricationDimensionUnitType Enumeration
 Fabrication dimension unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationDimensionUnitType
Public Enumeration FabricationDimensionUnitType
public enum class FabricationDimensionUnitType
type FabricationDimensionUnitType
Members
Member name | Value | Description
NoUnits | 0 |  NoUnits.
Linear | 1 |  Linear.
Angular | 2 |  Angular.
See Also
Reference
Autodesk.Revit.DB Namespace